silvercorked/OvalMate/Ovalmate_dev/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v11.0
processor: LPC55S16
package_id: LPC55S16JBD100
mcu_data: ksdk2_0
processor_version: 11.0.2
board: LPCXpresso55S16
pin_labels:
- {pin_num: '32', pin_signal: RESETN, label: '(Reset Microcontroller) SW2/J7[2]/J10[9]/J10[10]/U18[16]/N4M_RESET#', identifier: SW2;RESET}
- {pin_num: '98', pin_signal: USB0_DM, label: '(USB FS  DM) J3[2]/FS_USB0_DN', identifier: USB0_DM}
- {pin_num: '97', pin_signal: USB0_DP, label: '(USB FS DP) J3[3]/FS_USB0_DP', identifier: USB0_DP}
- {pin_num: '54', pin_signal: PIO0_0/FC3_SCK/CTIMER0_MAT0/SCT_GPI0/SECURE_GPIO0_0/ACMP0_A, label: '(Emergency Bump Switch Interrupt)  J11[2]/J13[5]/ARD_CMP0_IN_A'}
- {pin_num: '7', pin_signal: PIO0_1/FC3_CTS_SDA_SSEL0/CT_INP0/SCT_GPI1/CMP0_OUT/SECURE_GPIO0_1, label: '(Stepper Y Home (Input) (active low)) J11[3]/J12[1]/EXP_CMP0_OUT'}
- {pin_num: '81', pin_signal: PIO0_2/FC3_TXD_SCL_MISO_WS/CT_INP1/SCT0_OUT0/SCT_GPI2/SECURE_GPIO0_2, label: '(Stepper PWM Output X) J10[20]/U24[12]/FC3_SPI_MISO'}
- {pin_num: '83', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/SECURE_GPIO0_3, label: '(Stepper PWM Output Y) J10[18]/U24[11]/FC3_SPI_MOSI'}
- {pin_num: '86', pin_signal: PIO0_4/CAN0_RD/FC4_SCK/CT_INP12/SCT_GPI4/FC3_CTS_SDA_SSEL0/SECURE_GPIO0_4, label: '(7-Segment, Leg A) J10[16]/U24[14]/FC3_SPI_SSEL0'}
- {pin_num: '88', pin_signal: PIO0_5/CAN0_TD/FC4_RXD_SDA_MOSI_DATA/CTIMER3_MAT0/SCT_GPI5/FC3_RTS_SCL_SSEL1/MCLK/SECURE_GPIO0_5, label: '(7-Segment, Leg B)  J9[7]/J17[7]/J18[2]/SW4/JS3[1]/U22[11]/N4M_ISP_MODE',
  identifier: SW4;ISP}
- {pin_num: '89', pin_signal: PIO0_6/FC3_SCK/CT_INP13/CTIMER4_MAT0/SCT_GPI6/SECURE_GPIO0_6, label: '(7-Segment, Leg C)  J10[14]/U24[13]/FC3_SPI_SCK'}
- {pin_num: '6', pin_signal: PIO0_7/FC3_RTS_SCL_SSEL1/FC5_SCK/FC1_SCK/SECURE_GPIO0_7, label: (Stepper X Reset (OUTPUT) (active low)) J22/P0_7}
- {pin_num: '26', pin_signal: PIO0_8/FC3_SSEL3/FC5_RXD_SDA_MOSI_DATA/SWO/SECURE_GPIO0_8, label: '(7-Segment, Leg D) J23/PIO0_8'}
- {pin_num: '55', pin_signal: PIO0_9/FC3_SSEL2/FC5_TXD_SCL_MISO_WS/SECURE_GPIO0_9/ACMP0_B, label: (Bump Switch Interrupt UP) J24/PI00_9}
- {pin_num: '21', pin_signal: PIO0_10/FC6_SCK/CT_INP10/CTIMER2_MAT0/FC1_TXD_SCL_MISO_WS/SCT0_OUT2/SWO/SECURE_GPIO0_10/ADC0_1, label: '(bootloading (not used on dev
    board)) J9[1]/U18[12]/N4M_SWO', identifier: DEBUG_SWD_SWO}
- {pin_num: '13', pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SWCLK/SECURE_GPIO0_11/ADC0_9, label: '(bootloading (not used on dev board))
    J10[8]/U18[4]/N4M_SWDCLK', identifier: DEBUG_SWD_SWDCLK}
- {pin_num: '12', pin_signal: PIO0_12/FC3_TXD_SCL_MISO_WS/FREQME_GPIO_CLK_B/SCT_GPI7/SWDIO/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_12/ADC0_10, label: '(bootloading (not
    used on dev board)) J10[6]/U18[8]/N4M_SWDIO', identifier: DEBUG_SWD_SWDIO}
- {pin_num: '71', pin_signal: PIO0_13/FC1_CTS_SDA_SSEL0/UTICK_CAP0/CT_INP0/SCT_GPI0/FC1_RXD_SDA_MOSI_DATA/PLU_IN0/SECURE_GPIO0_13, label: '(7-Segment, Leg E)  J13[9]/J13[10]/J18[8]/JS5[2]/FC1_I2C_SDA'}
- {pin_num: '72', pin_signal: PIO0_14/FC1_RTS_SCL_SSEL1/UTICK_CAP1/CT_INP1/SCT_GPI1/FC1_TXD_SCL_MISO_WS/PLU_IN1/SECURE_GPIO0_14, label: '(7-Segment, Leg F)  J13[11]/J13[12]/J18[6]/JS4[2]/FC1_I2C_SCL'}
- {pin_num: '22', pin_signal: PIO0_15/FC6_CTS_SDA_SSEL0/UTICK_CAP2/CT_INP16/SCT0_OUT2/SECURE_GPIO0_15/ADC0_2, label: '(Servo PWM Output) J12[12]/ARD_INT_P0_15'}
- {pin_num: '14', pin_signal: PIO0_16/FC4_TXD_SCL_MISO_WS/CLKOUT/CT_INP4/SECURE_GPIO0_16/ADC0_8, label: '(IR Sensor Input) J7[1]/J13[1]/JP4[1]/ARD_MIK_ADC0_8_N'}
- {pin_num: '56', pin_signal: PIO0_18/FC4_CTS_SDA_SSEL0/CTIMER1_MAT0/SCT0_OUT1/PLU_IN3/SECURE_GPIO0_18/ACMP0_C, label: '(7-Segment, Leg G)  J11[1]/J12[19]/EXP_CMP0_IN_C'}
- {pin_num: '70', pin_signal: PIO0_24/FC0_RXD_SDA_MOSI_DATA/CT_INP8/SCT_GPI0/SECURE_GPIO0_24, label: (extra GPIO) J26/P0_24}
- {pin_num: '79', pin_signal: PIO0_25/FC0_TXD_SCL_MISO_WS/CT_INP9/SCT_GPI1/SECURE_GPIO0_25, label: (extra GPIO) J27/P0_25}
- {pin_num: '60', pin_signal: PIO0_26/FC2_RXD_SDA_MOSI_DATA/CLKOUT/CT_INP14/SCT0_OUT5/USB0_IDVALUE/FC0_SCK/HS_SPI_MOSI/SECURE_GPIO0_26, label: '(extra GPIO) J7[6]/J9[14]/ARD_MIK_HSSPI_MOSI'}
- {pin_num: '27', pin_signal: PIO0_27/FC2_TXD_SCL_MISO_WS/CTIMER3_MAT2/SCT0_OUT6/FC7_RXD_SDA_MOSI_DATA/PLU_OUT0/SECURE_GPIO0_27, label: '(extra gpio) J8[4]/J12[14]/ARD_MIK_FC2_USART_TXD'}
- {pin_num: '66', pin_signal: PIO0_28/FC0_SCK/CT_INP11/SCT0_OUT7/USB0_OVERCURRENTN/PLU_OUT1/SECURE_GPIO0_28, label: '(extra GPIO) U5[1]/FS_USB0_OCP#'}
- {pin_num: '92', pin_signal: PIO0_29/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT3/SCT0_OUT8/CMP0_OUT/PLU_OUT2/SECURE_GPIO0_29, label: '(extra GPIO) U11[14]/U22[14]/FC0_USART_RXD',
  identifier: DEBUG_UART_RX}
- {pin_num: '94', pin_signal: PIO0_30/FC0_TXD_SCL_MISO_WS/CTIMER0_MAT0/SCT0_OUT9/SECURE_GPIO0_30, label: '(extra GPIO, bootloading) U11[13]/U22[13]/FC0_USART_TXD',
  identifier: DEBUG_UART_TX}
- {pin_num: '59', pin_signal: PIO1_1/FC3_RXD_SDA_MOSI_DATA/CT_INP3/SCT_GPI5/HS_SPI_SSEL1/USB1_OVERCURRENTN/PLU_OUT4, label: '(Stepper Y Enable (OUTPUT) (active low))
    J7[3]/J9[16]/ARD_MIK_HSSPI_SSEL1'}
- {pin_num: '61', pin_signal: PIO1_2/CAN0_TD/CTIMER0_MAT3/SCT_GPI6/HS_SPI_SCK/USB1_PORTPWRN/PLU_OUT5, label: '(extra GPIO) J7[4]/J9[10]/ARD_MIK_HSSPI_SCK'}
- {pin_num: '1', pin_signal: PIO1_4/FC0_SCK/CTIMER2_MAT1/SCT0_OUT0/FREQME_GPIO_CLK_A, label: '(Stepper X Home (INPUT) (active low)) Q5[G1]/J12[6]/ARD_LEDR_PWM', identifier: LED_RED}
- {pin_num: '5', pin_signal: PIO1_6/FC0_TXD_SCL_MISO_WS/CTIMER2_MAT1/SCT_GPI3, label: '(Stepper X Direction (OUTPUT)) Q4[G1]/J12[10]/ARD_LEDB_PWM', identifier: LED_BLUE}
- {pin_num: '9', pin_signal: PIO1_7/FC0_RTS_SCL_SSEL1/CTIMER2_MAT2/SCT_GPI4, label: '(Stepper Y Fault (INPUT) (active low)) Q4[G2]/J12[8]/ARD_LEDG_PWM', identifier: LED_GREEN}
- {pin_num: '93', pin_signal: PIO1_11/FC1_TXD_SCL_MISO_WS/CT_INP5/USB0_VBUS, label: '(Stepper Y Sleep (OUTPUT) (active low)) J9[5]/EXP_P1_11'}
- {pin_num: '2', pin_signal: PIO1_13/FC6_RXD_SDA_MOSI_DATA/CT_INP6/USB0_OVERCURRENTN/USB0_FRAME, label: '(Stepper X Fault (INPUT) (active low)) J18[2]/J9[19]/FC6_I2S_RX',
  identifier: FC6_I2S_RX}
- {pin_num: '4', pin_signal: PIO1_20/FC7_RTS_SCL_SSEL1/CT_INP14/FC4_TXD_SCL_MISO_WS/PLU_OUT2, label: '(Stepper X Enable (OUTPUT) (active low)) U12[4]/U13[2]/J8[5]/J9[2]/FC4_I2C_SCL',
  identifier: FC4_I2C_SCL}
- {pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/FC3_SSEL3/PLU_OUT6, label: '(Stepper X Sleep (OUTPUT) (active low))J8[3]/J12[9]/J12[16]/ARD_MIK_FC2_USART_RXD'}
- {pin_num: '77', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/UTICK_CAP0/PLU_CLKIN, label: '(Bump Switch Interrupt RIGHT) J9[15]/J12[5]/I2S_IRQ', identifier: I2S_IRQ}
- {pin_num: '68', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CT_INP3/UTICK_CAP1/HS_SPI_SSEL3/PLU_IN5, label: '(Bump Switch Interrupt LEFT) U12[11]/J12[13]/J12[17]/ACC_INT_EXP_P1_26',
  identifier: ACCL_INTR}
- {pin_num: '85', pin_signal: PIO1_27/FC2_RTS_SCL_SSEL1/CTIMER0_MAT3/CLKOUT/PLU_IN4/CAN0_TD, label: '(Bump Switch Interrupt DOWN) U26[3]/CAN_TXD', identifier: CAN_TXD}
- {pin_num: '73', pin_signal: PIO1_28/FC7_SCK/CT_INP2/PLU_IN3, label: 'J9[17]/J18[2]/EXP_ISP_P1_28'}
- {pin_num: '80', pin_signal: PIO1_29/FC7_RXD_SDA_MOSI_DATA/SCT_GPI6/USB1_PORTPWRN/USB1_FRAME/PLU_IN2, label: '(Stepper Y Reset (OUTPUT) (active low)) U5[4]/HS_USB1_PWR_EN#'}
- {pin_num: '65', pin_signal: PIO1_30/FC7_TXD_SCL_MISO_WS/SCT_GPI7/USB1_OVERCURRENTN/USB1_LEDN/PLU_IN1, label: '(Stepper Y Direction (OUTPUT)) U5[2]/HS_USB1_OCP#'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

